# How do I select multiple rows and columns from a pandas DataFrame?

In [4]:
import pandas as pd

In [7]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [9]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

.head() or .tail() methods provides the first few and last few rows. However loc has more functionality.

In [11]:
ufo.loc[0,:]

City                       Ithaca
Colors Reported               NaN
Shape Reported           TRIANGLE
State                          NY
Time               6/1/1930 22:00
Name: 0, dtype: object

loc is a dataframe method for filtering rows and selecting columns by lables. Lables is Rows by index and columns by column names. 

Format for loc is 1. Rows,2. Columns in the above examle 0 defines 1st row and : defines all columns

In [15]:
ufo.loc[[0,1,2],:]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

For selecting multiple rows a list can be passed , as in above example three rows are selected and all columns. 
However mentioning every row number is not requried can be done in more concise way. Below is the example.

In [17]:
ufo.loc[0:2,:]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

While using 0:2 0 and 2 both are inclusive

In [23]:
ufo.loc[:,'City'].head()

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
Name: City, dtype: object

Above code is jut opposite where all the rows of City column is extracted.

In [25]:
ufo.loc[:,['City','State']].head()

                   City State
0                Ithaca    NY
1           Willingboro    NJ
2               Holyoke    CO
3               Abilene    KS
4  New York Worlds Fair    NY

In this scenario all the rows for City and State column is taken. Also similar to above piece range can be selected.

Below is the example.

In [29]:
ufo.loc[0:2,'City':'State'].head()

          City Colors Reported Shape Reported State
0       Ithaca             NaN       TRIANGLE    NY
1  Willingboro             NaN          OTHER    NJ
2      Holyoke             NaN           OVAL    CO

Similar thing can be acheived in a different process

In [30]:
ufo.head(3).drop('Time',axis=1)

          City Colors Reported Shape Reported State
0       Ithaca             NaN       TRIANGLE    NY
1  Willingboro             NaN          OTHER    NJ
2      Holyoke             NaN           OVAL    CO

##### Using loc with boolean condition

In [39]:
ufo[ufo.City=='Holyoke']

          City Colors Reported Shape Reported State              Time
2      Holyoke             NaN           OVAL    CO   2/15/1931 14:00
771    Holyoke             NaN           DISK    MA   1/20/1963 22:00
3221   Holyoke             NaN           DISK    MA    6/5/1976 23:00
7982   Holyoke             NaN          LIGHT    MA    4/1/1995 18:00
18211  Holyoke             NaN        DIAMOND    MA  12/28/2000 18:00

Previously , above method was used for filtering the DataFrame, however similar result can achived using  loc

In [43]:
ufo.loc[ufo.City=='Holyoke',:]

          City Colors Reported Shape Reported State              Time
2      Holyoke             NaN           OVAL    CO   2/15/1931 14:00
771    Holyoke             NaN           DISK    MA   1/20/1963 22:00
3221   Holyoke             NaN           DISK    MA    6/5/1976 23:00
7982   Holyoke             NaN          LIGHT    MA    4/1/1995 18:00
18211  Holyoke             NaN        DIAMOND    MA  12/28/2000 18:00